{
	# Фронт-энд бота
	"jabber": {
		# Если не задан, будет localhost
		"server": "jabber.tld",
		# Если не задано - 5222 для нешифрованного соединения или для starttls и 5223 для голого (старорежимного) ssl
		"port": 5222,
		# Включить шифрование
		"ssl": true,
		# Это более современный протокол и как раз на нём работет большинство jabber-серверов, порт 5222,
		# jabber.ru по этому протоколу как-то странно работает, если его включить, я получаю
		# tls: first record does not look like a TLS handshake
		"starttls" : true,
		# Не проверяем сертификаты по-умолчанию.
		# Вам правда хочется всё это проверять? Там по идее могут быть всякие Lets Encrypt, которые хоть и работают, но
		# создают кучу проблем
		"ssl_verify": false,
		# Позволять авторизацию логин-паролем по незашифрованному каналу связи
		"insecureallowunencryptedauth": false,
		# Таймаут установления соединения с сервером, в секундах. 10 секунд, если не задано.
		"connection_timeout": 10,
		# Задержка перед пере-коннекчиванием. 3 секунды, если не задано.
		"reconnect_delay": 3,
		# Промежуток между пингами сервера, для определения его живости. По-умолчанию 60 секунд.
		# Пинги посылаются, если в течение этого времени не было активности со стороны сервера.
		"server_ping_delay": 60,
		# Промежуток между пингами muc-ов. По-умолчанию 900 секунд. (Согласно рекомендации в xep-0410.)
		# Пинги посылаются, если в течение этого времени не было активности со стороны muc-а.
		"muc_ping_delay": 900,
		# Сколько ждать перед переджоиванием к комнате. По-умолчанию, 3 секунды.
		"muc_rejoin_delay": 3,
		# Ping-to-ping splay delay. Варьируемая задержка между пингами, чтобы не набирать высокий message rate.
		# По-умолчанию, 3 секунды. Под капотом преобразуются в миллисекунды. Важна для пингов MUC-ов, особенно,
		# если их МНОГО.
		"ping_splay_delay": 3,
		# Ник бота, с которым он будет заходить в комнаты
		"nick": "buny",
		"resource" : "buny bot",
		# Имя пользователя для авторизации на сервере
		"user": "buny@jabber.tld",
		# Пароль для авторизации
		"password": "secret",
		# Jabber-каналы, к которым бот попробует присоединиться при старте
		"channels": [
			"my_channel@conference.jabber.tld",
			"another_channel@conference.jabber.tld"
		]
	},

	# Многословность логов. Если не задано, то info. Debug - ДЕЙСТВИТЕЛЬНО вербозный уровень логгирования.
	# Есть ещё trace :)
	"loglevel": "debug",

	# Если не задан, логи идут в STDOUT
	"log": "/var/log/echo-jabber-bot/echo-jabber-bot.log",
}
